luhn.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Fun with simple lookup tables (and LOOP)</title>
<!-- 2017-12-23 Sat 00:28 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Josh Berry" />
<link rel="stylesheet" type="text/css" href="org-overrides.css" />
</head>
<body>
<div id="content">
<h1 class="title">Fun with simple lookup tables (and LOOP)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Luhn Algorithm</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Luhn Algorithm</h2>
<div class="outline-text-2" id="text-1">
<p>
In the book <a href="https://www.amazon.com/Think-Like-Programmer-Introduction-Creative/dp/1593274246">"Think Like a Programmer"</a>, one of the leading chapters
discusses writing a Luhn Algorithm application.  Once you read this
correctly &#x2013; so, two tries by me, due to late night reading &#x2013; the
code is straight forward and fun to consider.
</p>

<p>
The method taken by that text covers a very literal "by the algorithm"
interpretation.  There is absolutely nothing wrong with this, and it
has several points in its favor.  However, I have grown more
interested in lookup table based approaches.  
</p>

<p>
To that end, I thought I would try this with elisp.  This further let
me have fun with the LOOP macro.  What I came up with is the
following:
</p>

<div class="org-src-container">

<pre class="src src-elisp" id="luhn-check">(<span style="color: #fa9a4b; font-weight: bold;">defun</span> <span style="color: #72aaca;">luhn-check</span> (code)
  (<span style="color: #fa9a4b; font-weight: bold;">let</span> ((len (length code)))
    (equal 0
           (mod (<span style="color: #fa9a4b; font-weight: bold;">loop</span> for i from 1 to len
                      sum (cadr (assoc (elt code (- len i))
                                       (<span style="color: #fa9a4b; font-weight: bold;">if</span> (equal (mod i 2) 0)
                                           '((?0 0)
                                             (?1 2)
                                             (?2 4)
                                             (?3 6)
                                             (?4 8)
                                             (?5 1)
                                             (?6 3)
                                             (?7 5)
                                             (?8 7)
                                             (?9 9))
                                         '((?0 0)
                                           (?1 1)
                                           (?2 2)
                                           (?3 3)
                                           (?4 4)
                                           (?5 5)
                                           (?6 6)
                                           (?7 7)
                                           (?8 8)
                                           (?9 9))))))
                10))))

(append '((<span style="color: #cfe2f2;">"*Input*"</span> <span style="color: #cfe2f2;">"*Result*"</span>))
        (mapcar (<span style="color: #fa9a4b; font-weight: bold;">lambda</span> (n) (list n (luhn-check n)))
                '(<span style="color: #cfe2f2;">"1230"</span>
                  <span style="color: #cfe2f2;">"1231"</span>
                  <span style="color: #cfe2f2;">"1232"</span>
                  <span style="color: #cfe2f2;">"1233"</span>
                  <span style="color: #cfe2f2;">"1234"</span>
                  <span style="color: #cfe2f2;">"1235"</span>
                  <span style="color: #cfe2f2;">"1236"</span>
                  <span style="color: #cfe2f2;">"1237"</span>
                  <span style="color: #cfe2f2;">"1238"</span>
                  <span style="color: #cfe2f2;">"1239"</span>
                  <span style="color: #cfe2f2;">"25239"</span>)))
</pre>
</div>

<p>
Which, thankfully, gives what look to be the correct answers below.
Yes, I originally screwed up the check for odd/even digit.  Yay tests.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="right"><b>Input</b></td>
<td class="left"><b>Result</b></td>
</tr>

<tr>
<td class="right">1230</td>
<td class="left">t</td>
</tr>

<tr>
<td class="right">1231</td>
<td class="left">nil</td>
</tr>

<tr>
<td class="right">1232</td>
<td class="left">nil</td>
</tr>

<tr>
<td class="right">1233</td>
<td class="left">nil</td>
</tr>

<tr>
<td class="right">1234</td>
<td class="left">nil</td>
</tr>

<tr>
<td class="right">1235</td>
<td class="left">nil</td>
</tr>

<tr>
<td class="right">1236</td>
<td class="left">nil</td>
</tr>

<tr>
<td class="right">1237</td>
<td class="left">nil</td>
</tr>

<tr>
<td class="right">1238</td>
<td class="left">nil</td>
</tr>

<tr>
<td class="right">1239</td>
<td class="left">nil</td>
</tr>

<tr>
<td class="right">25239</td>
<td class="left">t</td>
</tr>
</tbody>
</table>

<p>
At any rate, what did I get to learn in this small exercise?  Not
much, to be honest.  Seeing the lookup tables does show that 0 and 9
are unchanged in the branch, so I can see how these would not catch
all transliterations easily.  
</p>

<p>
Checking the <a href="https://en.wikipedia.org/wiki/Luhn_algorithm">Wikipedia</a> page, I see there is also a weakness around
some twin digits.  That is not tough to see, but I am not sure that
this method presents them more obviously than the other.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Josh Berry</p>
<p class="date">Created: 2017-12-23 Sat 00:28</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
